Tekla Open API Reference for Tekla Structures 2025
Symbol.SymbolAttributes.Color Property
 The symbol color. Does not have an effect on symbols where the color is already defined in the symbol file.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DrawingColors Color { get; set; }
Public Property Color As DrawingColors
	Get
	Set
Property Value
Type: DrawingColors
See Also
Reference
Symbol.SymbolAttributes Class
Tekla.Structures.Drawing Namespace